#+TITLE: Resumen Parte 1
**** Constantes Numéricas Reales
     - Si no se le agrega sufijo ~f~ ó ~F~, entonces es del tipo ~double~ (por defecto)
     - Se agrega el sufijo ~f~ ó ~F~ para el tipo ~float~
     - Los sufijos se pueden mezclar excepto ~l~ y ~LL~ (Ej. ul, UL, ULL, uLL)
     - El ~.~ se denomina *punto decimal* y puede tener o no digitos delante o detrás
     - Los sufijos ~u~ (unsigned), ~l~ (long) son algunos de los *especificadores de tipo* [[Especificadores de tipo][(Ir a Referencia)]]
      
     #+name: concepto-constantes-reales
     #+BEGIN_QUOTE
     Los números reales se definen con “float” o “double”.
     La diferencia entre ambas es la *precisión* que ofrece su representación interna.
     
     Hay un _número infinito de reales_, pero _se representan con un número finito de bits_.
     A mayor número de bits, mayor número de reales se representan, y por tanto, mayor precisión.

     Los reales definidos con “double” tienen el doble de tamaño que los definidos con “float”
     #+END_QUOTE

     #+name: constantes-reales
     |----------------+-------------------------------------------------------------------------------------------------------------------------|
     | Constante Real | Descripción                                                                                                             |
     |----------------+-------------------------------------------------------------------------------------------------------------------------|
     | Decimal        | Debe tener la *parte fraccionaria* (el punto) ó el exponente (e ó E) ó ambos                                            |
     | Hexadecimal    | Comienza con ~0x~ ó ~0X~ seguido de la parte fraccionaria (en hexa), debe tener el exponente (p ó P) que está en base 2 |
     |----------------+-------------------------------------------------------------------------------------------------------------------------|

     #+name: sufijo-constantes-reales
     |--------+-------------+------------|
     | Sufijo | Descripción |            |
     |--------+-------------+------------|
     | f, F   | float       | IMPORTANTE |
     |--------+-------------+------------|
     | u, U   | unsigned    |            |
     | l, L   | long        |            |
     | ll, LL | long long   |            |
     |--------+-------------+------------|

     #+name: tipos-constante-real
     |-----------+---------+-------------+-----------------|
     | Constante | Sufijo  | Tipo        | Rango/Precisión |
     |-----------+---------+-------------+-----------------|
     | Real      | Ninguno | double      |                 |
     | Real      | f ó F   | float       | menor           |
     | Real      | l o L   | long double | mayor           |
     |-----------+---------+-------------+-----------------|

     #+name: codigo-ejemplo1-constantes-reales
     #+BEGIN_SRC C :results verbatim
       #include <stdio.h>

       int main(){
         double a = 5e4;

         printf("a=%e\n", a);
         printf("a=%E\n", a);

         return 0;
       }
     #+END_SRC

     #+RESULTS: codigo-ejemplo1-constantes-reales
     : a=5.000000e+04
     : a=5.000000E+04

     #+name: ejemplo1-constantes-reales
     #+BEGIN_QUOTE
     5e4 // double 5x10^4 (la ~e~ es el exponente para *constante real decimal* porque no empieza con ~0x~ ni ~0X~)
     .2f // float con valor 0,2
     3.L  // long double con valor 3,0

     0xAp2 // double con valor 10x2^2 (porque la ~p~ es el exponente para *constante real hexadecimal* éste empieza con ~0x..~ y tiene base 2)
     0xBp3 // double con valor 11x2^2
     #+END_QUOTE

**** Operador de Incremento y Decremento
     - El operador de incemento es ~++~ y el operador de decremento es ~--~
     - Según si se colocan antes o después de la expresión, el operador estará como *prefijo* ó *postfijo*
     - El *operando* (osea el identificador, que es la *expresión* más simple) debe ser un *ValorL modificable* [[ValorL y ValorR][(Ir a Referencia)]]
     - Si el *operando* es un *ValorL modificable*, se incrementa en 1 su valor y hay *Efecto de lado* [[Efecto Lateral][(Ir a Referencia)]]
  
     #+name: operador-incremento-como-postfijo
     #+BEGIN_SRC C :results verbatim
       #include <stdio.h>

       int main(){
         int a = 5;

         // POST INCREMENTO
         // 1. Se suma 2 al valor del operando del operador ++
         // 2. El resultado se le asigna como Valor al Objeto num (Osea.. num = 5+2 = 7)
         // 3. Luego se incrementa en 1 el valor del operando del operador ++ (porque el operando a, es ValorL modificable)
         // osea después que el resultado de sumarle 2 al valor original de a
         int num = a++ + 2;

         printf("num=%d (hizo 5+2 en vez de 6+2)\n", num);
         printf("a=%d\n", a);

         return 0;
       }
     #+END_SRC

     #+RESULTS: operador-incremento-como-postfijo
     : num=7 (hizo 5+2 en vez de 6+2)
     : a=6

     #+name: operador-incremento-como-prefijo
     #+BEGIN_SRC C :results verbatim
       #include <stdio.h>

       int main(){
         int a=5;

         // PREINCREMENTO
         // 1. Se incrementa el valor del operando de ++ (porque es un ValorL modificable)
         // 2. El valor incrementado en 1 del operando, se le suma 2
         //
         // - el identificador num, se conoce como ValorL (y es modificable)
         // (que también se conoce como Objeto, ó como la Expresión mas simple)
         //
         // - el resultado de la operación de preincrementar a, y sumarle 2, es el ValorR
         // (que también es valor del objeto num)

         int num = ++a + 2;
         printf("num=%d (hizo (5+1) + 2)\n", num);
         printf("a=%d\n\n", a);

         int test = ++a+2; // es válido juntar todo

         printf("test=%d (hizo (6+1) + 2)\n", test);
         printf("a=%d\n", a);
       }
     #+END_SRC

     #+RESULTS: operador-incremento-como-prefijo
     : num=8 (hizo (5+1) + 2)
     : a=6
     : 
     : test=9 (hizo (6+1) + 2)
     : a=7
     
     #+name: valorl-errores
     #+BEGIN_SRC C :results verbatim
       /*
        ,* ERROR (1): Porque primero se ejecuta el operador de incremento ++ que está como prefijo,
        ,* el resultado será una Constante Numerica Entera, por tanto ya no es un ValorL modificable
        ,* que es lo que necesita el operador de incremento ++ que esta como postfijo
        ,* (además "suponiendo" que pudiera avanzar, faltaría un operador para operar con el 1)
        ,*
        ,* ERROR (2): Porque primero se ejecuta el operador de incremento ++ que esta como postfijo
        ,* e incrementa en 1 el valor de su operando a (porque es un ValorL),
        ,* el resultado de haberlo incrementado es una Constante Numerica Entera, por tanto ya no es un ValorL modificable
        ,* y el operador de incremento ++ que le sigue hace que tire error (porque necesita un ValorL modificable)
        ,* y al romper ahí ya no evalúa lo que le sigue que es +a;
        ,* */
       int main(){
         int x = 1;
         printf("x=%d (1), x=%d (1), x=%d (2)\n\n", x, x++, x++); // <-- medio raro .. (?)

         x = 1;
         printf("x=%d (1), ", x);
         printf("x=%d (1), ", x++);
         printf("x=%d (2), ", x++);
         printf("x=%d (3)\n\n", x);

         int a = 5;
         int b = ++a + 2; // en la asignación (5+1) + 2, quedando a=6
         printf("b=%d, a=%d\n", b, a);

         int c = ++a+2; // en la asignación (6+1) + 2, quedando a=7
         printf("c=%d, a=%d\n", c, a);

         // int d = ++a++1; // ERROR (1)

         // int h = a+++++a; // ERROR (2) hubiera estado OK si fuese a++ + ++a

         int f = a+++a++; // ok.. es igual que "a++ + a++".. en la asignación f=7 + 8 ? (al leer 'a' por 2da vez tiene valor 8?), luego a=9
         printf("f=%d, a=%d\n", f, a);

         int i = ++a+a++; // ok.. en la asignación i=((9+1) + (10+1) ) <- al leer, luego a= 11
         printf("i=%d, a=%d\n", i, a);

         printf("\na=%d, b=%d, c=%d, f=%d, i=%d\n", a, b, c, f, i);

         return 0;
       }
     #+END_SRC

     #+RESULTS: valorl-errores
     #+begin_example
     x=3 (1), x=2 (1), x=1 (2)

     x=1 (1), x=1 (1), x=2 (2), x=3 (3)

     b=8, a=6
     c=9, a=7
     f=15, a=9
     i=21, a=11

     a=11, b=8, c=9, f=15, i=21
     #+end_example
